const obj = {
    code: 0,
    message: 'ok',
    data: {
        title: '《消愁》 - 我喜欢的音乐',
        title1:'消愁',
        author: '毛不易',
        duration: '04:21',
        pic: 'https://p1.music.126.net/3L4q_THtqVP0Tuofry303Q==/109951168543731054.jpg?imageView=1&type=webp&thumbnail=85x0',
        pic1: 'https://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?imageView&thumbnail=360y360&quality=75&tostatic=0',
        pic2: 'http://p1.music.126.net/vmCcDvD1H04e9gm97xsCqg==/109951163350929740.jpg?imageView&thumbnail=50y50&quality=15&tostatic=0',
        audio: 'https://m801.music.126.net/20230623191641/406f626fcc577c0f1e3d3ea69c3fc556/jdyyaac/obj/w5rDlsOJwrLDjj7CmsOj/28481680356/9cef/6518/cfc8/25113cb2c940ddb529b64ecf946ed34f.m4a',
        lyric: '[00:00.000] 作词 : 毛不易\n[00:00.549] 作曲 : 毛不易\n[00:01.098] 编曲 : 赵兆\n[00:01.647] 制作人 : 李健/赵兆\n[00:02.196]\n[00:31.626]当你走进这欢乐场\n[00:35.809]背上所有的梦与想\n[00:40.096]各色的脸上各色的妆\n[00:44.392]没人记得你的模样\n[00:47.926]\n[00:48.679]三巡酒过你在角落\n[00:52.947]固执的唱着苦涩的歌\n[00:57.198]听它在喧嚣里被淹没\n[01:01.143]你拿起酒杯对自己说\n[01:05.570]\n[01:07.825]一杯敬朝阳 一杯敬月光\n[01:11.847]唤醒我的向往 温柔了寒窗\n[01:15.599]于是可以不回头地逆风飞翔\n[01:20.421]不怕心头有雨 眼底有霜\n[01:23.992]\n[01:24.774]一杯敬故乡 一杯敬远方\n[01:28.977]守着我的善良 催着我成长\n[01:32.813]所以南北的路从此不再漫长\n[01:37.599]灵魂不再无处安放\n[01:44.062]\n[02:03.441]躁动不安的座上客\n[02:07.561]自以为是地表演着\n[02:12.099]伪装着 舞蹈着 疲惫着\n[02:15.645]你拿起酒杯对自己说\n[02:20.495]一杯敬朝阳 一杯敬月光\n[02:24.753]唤醒我的向往 温柔了寒窗\n[02:28.531]于是可以不回头地逆风飞翔\n[02:33.196]不怕心头有雨 眼底有霜\n[02:36.900]\n[02:37.500]一杯敬故乡 一杯敬远方\n[02:41.855]守着我的善良 催着我成长\n[02:45.616]所以南北的路从此不再漫长\n[02:50.448]灵魂不再无处安放\n[02:55.697]\n[03:01.235]一杯敬明天 一杯敬过往\n[03:05.448]支撑我的身体 厚重了肩膀\n[03:09.182]虽然从不相信所谓山高水长\n[03:14.006]人生苦短何必念念不忘\n[03:17.951]\n[03:18.366]一杯敬自由 一杯敬死亡\n[03:22.599]宽恕我的平凡 驱散了迷惘\n[03:26.365]好吧天亮之后总是潦草离场\n[03:31.133]清醒的人最荒唐\n[03:37.806]清醒的人最荒唐\n[03:47.998]\n[03:50.221] 手风琴 : 许笑男\n[03:52.444] 键盘 : 赵兆\n[03:54.667] 吉他 : 薛峰\n[03:56.890] 贝斯 : 韩阳\n[03:59.113] 鼓 : 武勇恒\n[04:01.336] 和声 : 梁古驰\n[04:03.559] 弦乐 : 国际首席爱乐乐团International Philharmonic Orchestra\n[04:05.782] 混音 : 李游\n[04:08.005] 母带 : Joe LaPorta .（Sterling . NY）\n[04:10.228] 录音棚 : 55TEC . Beijing\n[04:12.451] 录音 : 李游 李杨\n[04:14.674] 人声录音 : 李杨\n[04:16.897] 人声编辑 : 李杨\n[04:19.120] 录音助理 : 郭舒文 邢铜\n[04:21.343] 制作发行 : 哇唧唧哇\n'
    }
}

const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}